## Q8. Consider the following data frame containing a family name, gender of the family member and her/his monthly income in each record.

In [1]:
import numpy as np
import pandas as pd

In [2]:
income = pd.read_excel('Monthly-Income.xlsx')

In [3]:
frame = pd.DataFrame(income)
frame

    Name  Gender  MonthlyIncome (Rs.)
0   Shah    Male               114000
1   Vats    Male                65000
2   Vats  Female                43150
3  Kumar  Female                69500
4   Vats  Female               155000
5  Kumar    Male               103000
6   Shah    Male                55000
7   Shah  Female               112400
8  Kumar  Female                81030
9   Vats    Male                71900

### Write a program in Python using Pandas to perform the following:

### a. Calculate and display familywise gross monthly income.

In [4]:
grouped = frame.groupby('Name')
grouped.agg('sum')

       MonthlyIncome (Rs.)
Name
Kumar               253530
Shah                281400
Vats                335050

### b. Calculate and display the member with the highest monthly income in a family.

In [5]:
grouped = frame.groupby('Name')
grouped.agg('max')

      Gender  MonthlyIncome (Rs.)
Name
Kumar   Male               103000
Shah    Male               114000
Vats    Male               155000

### c. Calculate and display monthly income of all members with income greater than Rs. 60000.00.

In [6]:
frame[frame['MonthlyIncome (Rs.)'] > 60000.00]

    Name  Gender  MonthlyIncome (Rs.)
0   Shah    Male               114000
1   Vats    Male                65000
3  Kumar  Female                69500
4   Vats  Female               155000
5  Kumar    Male               103000
7   Shah  Female               112400
8  Kumar  Female                81030
9   Vats    Male                71900

### d. Calculate and display the average monthly income of the female members in the Shah family.

In [7]:
frame[(frame['Name'] == 'Shah') & (frame['Gender'] == 'Female')].mean()

<ipython-input-7-8726a28f5e5b>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  frame[(frame['Name'] == 'Shah') & (frame['Gender'] == 'Female')].mean()

MonthlyIncome (Rs.)    112400.0
dtype: float64